user-4.1/tutorials/surfaceTracking/newInterFreeFoam/capillarity2DoneFluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.0 0.0 0.0223607 ) // # 0
    ( 1.0 0.0 0.0223607 ) // # 1
    ( 0.0 0.0 0.0670821 ) // # 2
    ( 1.0 0.0 0.0670821 ) // # 3
    ( 0.0 1.0 0.0223607 ) // # 4
    ( 1.0 1.0 0.0223607 ) // # 5
    ( 0.0 1.0 0.0670821 ) // # 6
    ( 1.0 1.0 0.0670821 ) // # 7
);

blocks
(
    hex ( 0 1 5 4 2 3 7 6 ) ( 20 20 1 ) simpleGrading ( 1.0 1.0 1.0 ) // # 0
);

edges
(
);

boundary
(
    bottomWall
    {
        type wall;
        faces
        (
            ( 0 1 3 2 )
        );
    }

    freeSurface
    {
        type patch;
        faces
        (
            ( 5 4 6 7 )
        );
    }

    leftWall
    {
        type wall;
        faces
        (
            ( 0 4 6 2 )
        );
    }

    rightWall
    {
        type wall;
        faces
        (
            ( 1 5 7 3 )
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            ( 0 1 5 4 )
            ( 2 3 7 6 )
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

